app/controllers/creators_controller.rb

SELECT "creators".* FROM "creators"
---
  def index
    @creators = Creator.all

SELECT  "creators".* FROM "creators" WHERE "creators"."id" = $1 ORDER BY "creators"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @creator = Creator.find(params[:id])